tap "homebrew/bundle"
tap "oven-sh/bun"
tap "r-lib/rig"

brew "asciinema"                # Record and share terminal sessions
brew "bat"                      # Clone of cat(1) with syntax highlighting and Git integration
brew "bob"                      # Version manager for neovim
brew "bun"                      # Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "coreutils"                # GNU File, Shell, and Text utilities
brew "curl"                     # Get a file from an HTTP, HTTPS or FTP server
brew "difftastic"               # Diff that understands syntax
brew "entr"                     # Run arbitrary commands when files change
brew "eza"                      # Modern, maintained replacement for ls
brew "fd"                       # Simple, fast and user-friendly alternative to find
brew "ffmpeg"       if OS.mac?  # Play, record, convert, and stream audio and video
brew "fish"                     # User-friendly command-line shell for UNIX-like operating systems
brew "fzf"                      # Command-line fuzzy finder written in Go
brew "gcc"                      # GNU compiler collection
brew "gh"           if OS.mac?  # GitHub command-line tool
brew "git-absorb"               # Automatic git commit --fixup
brew "go"           if OS.mac?  # Open source programming language to build simple/reliable/efficient software
brew "htop"                     # Improved top (interactive process viewer)
brew "ijq"                      # Interactive jq
brew "imagemagick"  if OS.mac?  # Tools and libraries to manipulate images in many formats
brew "jq"                       # Lightweight and flexible command-line JSON processor
brew "luarocks"     if OS.mac?  # Package manager for the Lua programming language
brew "mpv"          if OS.mac?  # Media player based on MPlayer and mplayer2
brew "n"                        # Node version management
brew "pandoc"                   # Swiss-army knife of markup format conversion
brew "pre-commit"               # Framework for managing multi-language pre-commit hooks
brew "pv"                       # Monitor data's progress through a pipe
brew "qrcp"         if OS.mac?  # Transfer files to and from your computer by scanning a QR code
brew "rclone"       if OS.mac?  # Rsync for cloud storage
brew "ripgrep"                  # Search tool like grep and The Silver Searcher
brew "rust"         if OS.mac?  # Safe, concurrent, practical language
brew "scc"                      # Fast and accurate code counter with complexity and COCOMO estimates
brew "sqlite"                   # Command-line interface for SQLite
brew "starship"                 # Cross-shell prompt for astronauts
brew "stow"                     # Organize software neatly under a single directory tree (e.g. /usr/local)
brew "tarsnap-gui"  if OS.mac?  # Cross-platform GUI for the Tarsnap command-line client
brew "tmux"                     # Terminal multiplexer
brew "tree-sitter"  if OS.mac?  # Parser generator tool and incremental parsing library
brew "unixodbc"                 # ODBC 3 connectivity for UNIX
brew "watch"                    # Executes a program periodically, showing output fullscreen
brew "yt-dlp"       if OS.mac?  # Feature-rich command-line audio/video downloader

cask "1password"           if OS.mac?  # Password manager that keeps all passwords secure behind one password
cask "1password-cli"       if OS.mac?  # Command-line interface for 1Password
cask "chromium"            if OS.mac?  # Free and open-source web browser
cask "deskpad"             if OS.mac?  # Virtual monitor for screen sharing
cask "discord"             if OS.mac?  # Voice and text chat software
cask "displaylink"         if OS.mac?  # Drivers for DisplayLink docks, adapters and monitors
cask "docker"              if OS.mac?  # App to build and share containerised applications and microservices
cask "firefox"             if OS.mac?  # Web browser
cask "font-jetbrains-mono-nerd-font"
cask "gimp"                if OS.mac?  # Free and open-source image editor
cask "inkscape"            if OS.mac?  # Vector graphics editor
cask "karabiner-elements"  if OS.mac?  # Keyboard customiser
cask "linearmouse"         if OS.mac?  # Customise mouse behavior
cask "obs"                 if OS.mac?  # Open-source software for live streaming and screen recording
cask "rectangle"           if OS.mac?  # Move and resize windows using keyboard shortcuts or snap areas
cask "rig"                             # The R Installation Manager
cask "rstudio"                         # Data science software focusing on R and Python
cask "slack"               if OS.mac?  # Team communication and collaboration software
cask "spotify"             if OS.mac?  # Music streaming service
cask "tunnelblick"         if OS.mac?  # Free and open-source OpenVPN client
cask "wezterm"             if OS.mac?  # GPU-accelerated cross-platform terminal emulator and multiplexer
cask "xquartz"             if OS.mac?  # Open-source version of the X.Org X Window System
