tap "homebrew/bundle"
tap "r-lib/rig"

cask "1password"           # Password manager that keeps all passwords secure behind one password
cask "1password-cli"       # Command-line interface for 1Password
cask "chromium"            # Free and open-source web browser
cask "deskpad"             # Virtual monitor for screen sharing
cask "discord"             # Voice and text chat software
cask "displaylink"         # Drivers for DisplayLink docks, adapters and monitors
cask "docker-desktop"      # App to build and share containerised applications and microservices
cask "firefox"             # Web browser
cask "gimp"                # Free and open-source image editor
cask "hammerspoon"         # Desktop automation application
cask "inkscape"            # Vector graphics editor
cask "karabiner-elements"  # Keyboard customiser
cask "linearmouse"         # Customise mouse behavior
cask "obs"                 # Open-source software for live streaming and screen recording
cask "rectangle"           # Move and resize windows using keyboard shortcuts or snap areas
cask "rig"                 # The R Installation Manager
cask "rstudio"             # Data science software focusing on R and Python
cask "slack"               # Team communication and collaboration software
cask "spotify"             # Music streaming service
cask "tunnelblick"         # Free and open-source OpenVPN client
cask "wezterm@nightly"     # GPU-accelerated cross-platform terminal emulator and multiplexer
cask "xquartz"             # Open-source version of the X.Org X Window System
